testes/jmeter.log
2025-10-20 12:09:06,452 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-10-20 12:09:06,486 INFO o.a.j.JMeter: Loading user properties from: /home/gercom/Besu/besu-production-docker/testes/apache-jmeter-5.6.3/bin/user.properties
2025-10-20 12:09:06,487 INFO o.a.j.JMeter: Loading system properties from: /home/gercom/Besu/besu-production-docker/testes/apache-jmeter-5.6.3/bin/system.properties
2025-10-20 12:09:06,487 INFO o.a.j.JMeter: Setting JMeter property: csvDataFile=/home/gercom/Besu/besu-production-docker/testes/jmeter_runs_5_users/open_accounts.csv
2025-10-20 12:09:06,488 INFO o.a.j.JMeter: Setting JMeter property: apiHost=10.126.1.249
2025-10-20 12:09:06,497 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-10-20 12:09:06,497 INFO o.a.j.JMeter: Version 5.6.3
2025-10-20 12:09:06,497 INFO o.a.j.JMeter: java.version=21.0.7
2025-10-20 12:09:06,497 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-10-20 12:09:06,498 INFO o.a.j.JMeter: os.name=Linux
2025-10-20 12:09:06,498 INFO o.a.j.JMeter: os.arch=amd64
2025-10-20 12:09:06,498 INFO o.a.j.JMeter: os.version=6.8.0-85-generic
2025-10-20 12:09:06,498 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-10-20 12:09:06,498 INFO o.a.j.JMeter: java.awt.headless=true
2025-10-20 12:09:06,499 INFO o.a.j.JMeter: Max memory     =1073741824
2025-10-20 12:09:06,499 INFO o.a.j.JMeter: Available Processors =8
2025-10-20 12:09:06,516 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-10-20 12:09:06,516 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-10-20 12:09:06,516 INFO o.a.j.JMeter: JMeterHome=/home/gercom/Besu/besu-production-docker/testes/apache-jmeter-5.6.3
2025-10-20 12:09:06,517 INFO o.a.j.JMeter: user.dir  =/home/gercom/Besu/besu-production-docker/testes
2025-10-20 12:09:06,517 INFO o.a.j.JMeter: PWD       =/home/gercom/Besu/besu-production-docker/testes
2025-10-20 12:09:06,517 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: gercom FullName: gercom
2025-10-20 12:09:06,547 INFO o.a.j.s.FileServer: Default base='/home/gercom/Besu/besu-production-docker/testes'
2025-10-20 12:09:06,550 INFO o.a.j.s.FileServer: Set new base='/home/gercom/Besu/besu-production-docker/testes/5_Users/Jmeter'
2025-10-20 12:09:06,963 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-10-20 12:09:07,016 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-10-20 12:09:07,022 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-10-20 12:09:07,028 INFO o.a.j.s.SaveService: Loading file: 5_Users/Jmeter/test_round1_open.jmx
2025-10-20 12:09:07,228 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-20 12:09:07,229 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-20 12:09:07,229 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-20 12:09:07,229 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-20 12:09:07,229 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-10-20 12:09:07,230 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-10-20 12:09:07,260 INFO o.a.j.JMeter: Creating summariser <summary>
2025-10-20 12:09:07,308 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-10-20 12:09:07,309 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-10-20 12:09:07,310 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-10-20 12:09:07,318 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-10-20 12:09:07,318 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-10-20 12:09:07,461 INFO o.a.j.JMeter: Running test (1760962147461)
2025-10-20 12:09:07,507 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Round 1: Open
2025-10-20 12:09:07,507 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Round 1: Open.
2025-10-20 12:09:07,507 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-10-20 12:09:07,508 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=0 delayedStart=false
2025-10-20 12:09:07,522 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-10-20 12:09:07,522 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-10-20 12:09:07,609 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-4
2025-10-20 12:09:07,609 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-5
2025-10-20 12:09:07,609 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-3
2025-10-20 12:09:07,610 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-1
2025-10-20 12:09:07,610 INFO o.a.j.t.JMeterThread: Thread started: Round 1: Open 1-2
2025-10-20 12:09:07,612 INFO o.a.j.s.FileServer: Stored: /home/gercom/Besu/besu-production-docker/testes/jmeter_runs_5_users/open_accounts.csv
2025-10-20 12:09:07,692 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = gercom
2025-10-20 12:09:07,705 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-10-20 12:09:07,708 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-10-20 12:09:07,708 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-10-20 12:09:07,708 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-10-20 12:09:07,709 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-10-20 12:09:27,730 INFO o.a.j.t.JMeterThread: Thread is done: Round 1: Open 1-1
2025-10-20 12:09:27,730 INFO o.a.j.t.JMeterThread: Thread finished: Round 1: Open 1-1
2025-10-20 12:09:27,731 INFO o.a.j.t.JMeterThread: Thread is done: Round 1: Open 1-3
2025-10-20 12:09:27,731 INFO o.a.j.t.JMeterThread: Thread finished: Round 1: Open 1-3
2025-10-20 12:09:27,731 INFO o.a.j.t.JMeterThread: Thread is done: Round 1: Open 1-4
2025-10-20 12:09:27,731 INFO o.a.j.t.JMeterThread: Thread finished: Round 1: Open 1-4
2025-10-20 12:09:27,732 INFO o.a.j.t.JMeterThread: Thread is done: Round 1: Open 1-5
2025-10-20 12:09:27,732 INFO o.a.j.t.JMeterThread: Thread finished: Round 1: Open 1-5
2025-10-20 12:09:27,734 INFO o.a.j.t.JMeterThread: Thread is done: Round 1: Open 1-2
2025-10-20 12:09:27,734 INFO o.a.j.t.JMeterThread: Thread finished: Round 1: Open 1-2
2025-10-20 12:09:27,735 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-10-20 12:09:27,735 INFO o.a.j.s.FileServer: Close: /home/gercom/Besu/besu-production-docker/testes/jmeter_runs_5_users/open_accounts.csv
2025-10-20 12:09:27,742 INFO o.a.j.r.Summariser: summary =   1000 in 00:00:20 =   49.3/s Avg:    10 Min:     1 Max:    81 Err:     0 (0.00%)