testes/jmeter.log
2025-08-02 19:12:28,011 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-08-02 19:12:28,058 INFO o.a.j.JMeter: Loading user properties from: /home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3/bin/user.properties
2025-08-02 19:12:28,059 INFO o.a.j.JMeter: Loading system properties from: /home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3/bin/system.properties
2025-08-02 19:12:28,059 INFO o.a.j.JMeter: Setting JMeter property: contractAddress=0x42699A7612A82f1d9C36148af9C77354759b210b
2025-08-02 19:12:28,059 INFO o.a.j.JMeter: Setting JMeter property: csvDataFile=/home/gercom/rede_recurso/besu-production-docker/testes/jmeter_runs/open_accounts.csv
2025-08-02 19:12:28,069 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-08-02 19:12:28,069 INFO o.a.j.JMeter: Version 5.6.3
2025-08-02 19:12:28,070 INFO o.a.j.JMeter: java.version=21.0.7
2025-08-02 19:12:28,070 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-08-02 19:12:28,070 INFO o.a.j.JMeter: os.name=Linux
2025-08-02 19:12:28,070 INFO o.a.j.JMeter: os.arch=amd64
2025-08-02 19:12:28,071 INFO o.a.j.JMeter: os.version=6.8.0-71-generic
2025-08-02 19:12:28,071 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-08-02 19:12:28,071 INFO o.a.j.JMeter: java.awt.headless=true
2025-08-02 19:12:28,071 INFO o.a.j.JMeter: Max memory     =1073741824
2025-08-02 19:12:28,072 INFO o.a.j.JMeter: Available Processors =8
2025-08-02 19:12:28,088 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-08-02 19:12:28,088 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-08-02 19:12:28,089 INFO o.a.j.JMeter: JMeterHome=/home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3
2025-08-02 19:12:28,089 INFO o.a.j.JMeter: user.dir  =/home/gercom/rede_recurso/besu-production-docker/testes
2025-08-02 19:12:28,089 INFO o.a.j.JMeter: PWD       =/home/gercom/rede_recurso/besu-production-docker/testes
2025-08-02 19:12:28,090 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: gercom FullName: gercom
2025-08-02 19:12:28,115 INFO o.a.j.s.FileServer: Default base='/home/gercom/rede_recurso/besu-production-docker/testes'
2025-08-02 19:12:28,118 INFO o.a.j.s.FileServer: Set new base='/home/gercom/rede_recurso/besu-production-docker/testes'
2025-08-02 19:12:28,482 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-08-02 19:12:28,528 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-08-02 19:12:28,534 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-08-02 19:12:28,540 INFO o.a.j.s.SaveService: Loading file: test_round2_query.jmx
2025-08-02 19:12:28,631 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-02 19:12:28,631 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-02 19:12:28,631 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-02 19:12:28,631 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-02 19:12:28,631 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-08-02 19:12:28,632 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-08-02 19:12:28,643 INFO o.a.j.JMeter: Creating summariser <summary>
2025-08-02 19:12:28,674 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-08-02 19:12:28,675 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-08-02 19:12:28,675 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-08-02 19:12:28,682 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-08-02 19:12:28,683 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-08-02 19:12:28,804 INFO o.a.j.JMeter: Running test (1754161948804)
2025-08-02 19:12:28,837 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Round 2: Query
2025-08-02 19:12:28,837 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Round 2: Query.
2025-08-02 19:12:28,838 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-08-02 19:12:28,838 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=0 delayedStart=false
2025-08-02 19:12:28,850 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-08-02 19:12:28,850 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-08-02 19:12:28,925 INFO o.a.j.t.JMeterThread: Thread started: Round 2: Query 1-1
2025-08-02 19:12:28,925 INFO o.a.j.t.JMeterThread: Thread started: Round 2: Query 1-3
2025-08-02 19:12:28,925 INFO o.a.j.t.JMeterThread: Thread started: Round 2: Query 1-4
2025-08-02 19:12:28,925 INFO o.a.j.t.JMeterThread: Thread started: Round 2: Query 1-2
2025-08-02 19:12:28,925 INFO o.a.j.t.JMeterThread: Thread started: Round 2: Query 1-5
2025-08-02 19:12:28,927 INFO o.a.j.s.FileServer: Stored: /home/gercom/rede_recurso/besu-production-docker/testes/jmeter_runs/open_accounts.csv
2025-08-02 19:12:28,973 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = gercom
2025-08-02 19:12:28,983 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-08-02 19:12:28,985 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-08-02 19:12:28,985 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-08-02 19:12:28,986 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-08-02 19:12:28,986 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-08-02 19:12:29,454 INFO o.a.j.t.JMeterThread: Thread is done: Round 2: Query 1-2
2025-08-02 19:12:29,455 INFO o.a.j.t.JMeterThread: Thread finished: Round 2: Query 1-2
2025-08-02 19:12:29,455 INFO o.a.j.t.JMeterThread: Thread is done: Round 2: Query 1-5
2025-08-02 19:12:29,456 INFO o.a.j.t.JMeterThread: Thread finished: Round 2: Query 1-5
2025-08-02 19:12:29,457 INFO o.a.j.t.JMeterThread: Thread is done: Round 2: Query 1-3
2025-08-02 19:12:29,457 INFO o.a.j.t.JMeterThread: Thread finished: Round 2: Query 1-3
2025-08-02 19:12:29,463 INFO o.a.j.t.JMeterThread: Thread is done: Round 2: Query 1-1
2025-08-02 19:12:29,463 INFO o.a.j.t.JMeterThread: Thread finished: Round 2: Query 1-1
2025-08-02 19:12:29,464 INFO o.a.j.t.JMeterThread: Thread is done: Round 2: Query 1-4
2025-08-02 19:12:29,464 INFO o.a.j.t.JMeterThread: Thread finished: Round 2: Query 1-4
2025-08-02 19:12:29,464 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-08-02 19:12:29,465 INFO o.a.j.s.FileServer: Close: /home/gercom/rede_recurso/besu-production-docker/testes/jmeter_runs/open_accounts.csv
2025-08-02 19:12:29,470 INFO o.a.j.r.Summariser: summary =   1000 in 00:00:01 = 1506.0/s Avg:     0 Min:     0 Max:    42 Err:  1000 (100.00%)