testes/jmeter.log
2025-08-04 00:38:16,552 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-08-04 00:38:16,583 INFO o.a.j.JMeter: Loading user properties from: /home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3/bin/user.properties
2025-08-04 00:38:16,583 INFO o.a.j.JMeter: Loading system properties from: /home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3/bin/system.properties
2025-08-04 00:38:16,584 INFO o.a.j.JMeter: Setting JMeter property: contractAddress=0xBb7016039D9504CF41AD8e396A9AD2A395da596A
2025-08-04 00:38:16,584 INFO o.a.j.JMeter: Setting JMeter property: csvDataFile=/home/gercom/rede_recurso/besu-production-docker/testes/jmeter_runs/transfer_accounts.csv
2025-08-04 00:38:16,584 INFO o.a.j.JMeter: Setting JMeter property: apiHost=10.126.1.232
2025-08-04 00:38:16,593 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-08-04 00:38:16,593 INFO o.a.j.JMeter: Version 5.6.3
2025-08-04 00:38:16,593 INFO o.a.j.JMeter: java.version=21.0.7
2025-08-04 00:38:16,594 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-08-04 00:38:16,594 INFO o.a.j.JMeter: os.name=Linux
2025-08-04 00:38:16,594 INFO o.a.j.JMeter: os.arch=amd64
2025-08-04 00:38:16,594 INFO o.a.j.JMeter: os.version=6.8.0-71-generic
2025-08-04 00:38:16,594 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-08-04 00:38:16,594 INFO o.a.j.JMeter: java.awt.headless=true
2025-08-04 00:38:16,595 INFO o.a.j.JMeter: Max memory     =1073741824
2025-08-04 00:38:16,595 INFO o.a.j.JMeter: Available Processors =8
2025-08-04 00:38:16,610 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-08-04 00:38:16,611 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-08-04 00:38:16,611 INFO o.a.j.JMeter: JMeterHome=/home/gercom/rede_recurso/besu-production-docker/testes/apache-jmeter-5.6.3
2025-08-04 00:38:16,611 INFO o.a.j.JMeter: user.dir  =/home/gercom/rede_recurso/besu-production-docker/testes
2025-08-04 00:38:16,612 INFO o.a.j.JMeter: PWD       =/home/gercom/rede_recurso/besu-production-docker/testes
2025-08-04 00:38:16,612 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: gercom FullName: gercom
2025-08-04 00:38:16,637 INFO o.a.j.s.FileServer: Default base='/home/gercom/rede_recurso/besu-production-docker/testes'
2025-08-04 00:38:16,640 INFO o.a.j.s.FileServer: Set new base='/home/gercom/rede_recurso/besu-production-docker/testes'
2025-08-04 00:38:16,998 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-08-04 00:38:17,045 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-08-04 00:38:17,051 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-08-04 00:38:17,057 INFO o.a.j.s.SaveService: Loading file: test_round3_transfer.jmx
2025-08-04 00:38:17,148 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-04 00:38:17,148 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-04 00:38:17,149 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-04 00:38:17,149 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-08-04 00:38:17,149 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-08-04 00:38:17,149 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-08-04 00:38:17,169 INFO o.a.j.JMeter: Creating summariser <summary>
2025-08-04 00:38:17,200 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-08-04 00:38:17,202 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-08-04 00:38:17,202 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-08-04 00:38:17,210 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-08-04 00:38:17,210 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-08-04 00:38:17,340 INFO o.a.j.JMeter: Running test (1754267897340)
2025-08-04 00:38:17,375 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Round 3: Transfer
2025-08-04 00:38:17,376 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Round 3: Transfer.
2025-08-04 00:38:17,376 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-08-04 00:38:17,377 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=0 delayedStart=false
2025-08-04 00:38:17,389 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-08-04 00:38:17,390 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-08-04 00:38:17,462 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-3
2025-08-04 00:38:17,462 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-5
2025-08-04 00:38:17,462 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-4
2025-08-04 00:38:17,462 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-2
2025-08-04 00:38:17,462 INFO o.a.j.t.JMeterThread: Thread started: Round 3: Transfer 1-1
2025-08-04 00:38:17,464 INFO o.a.j.s.FileServer: Stored: /home/gercom/rede_recurso/besu-production-docker/testes/jmeter_runs/transfer_accounts.csv
2025-08-04 00:38:17,507 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = gercom
2025-08-04 00:38:17,517 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-08-04 00:38:17,519 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-08-04 00:38:17,519 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-08-04 00:38:17,520 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-08-04 00:38:17,520 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-08-04 00:38:19,251 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-1
2025-08-04 00:38:19,252 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-4
2025-08-04 00:38:19,252 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-3
2025-08-04 00:38:19,252 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-4
2025-08-04 00:38:19,252 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-3
2025-08-04 00:38:19,252 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-2
2025-08-04 00:38:19,252 INFO o.a.j.t.JMeterThread: Thread is done: Round 3: Transfer 1-5
2025-08-04 00:38:19,253 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-2
2025-08-04 00:38:19,253 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-5
2025-08-04 00:38:19,252 INFO o.a.j.t.JMeterThread: Thread finished: Round 3: Transfer 1-1
2025-08-04 00:38:19,255 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-08-04 00:38:19,255 INFO o.a.j.s.FileServer: Close: /home/gercom/rede_recurso/besu-production-docker/testes/jmeter_runs/transfer_accounts.csv
2025-08-04 00:38:19,259 INFO o.a.j.r.Summariser: summary =     50 in 00:00:02 =   26.1/s Avg:   159 Min:   122 Max:   249 Err:     0 (0.00%)